import random;
import time;
#Импорт библиотек
def mainmenu():
	#Функция вызова главного меню
	print("--------------------------------------------------------------------------------------------------------");
	print("|                                                                                                      |");
	print("--------------------------------------------------------------------------------------------------------");
	print("| | ___    ___ |  |\  \    /  /|  | ___    ___ |        |     _   \    |     __  \     /  _____  \     |");
	print("| |/   |  |   \|  |/\  \  /  /\|  |/   |  |   \|        |/|  | \   |   |/|  |  |  \   /  /     \  \    |");
	print("|      |  |          \  \/  /          |  |               |  |  |  |     |  |  |  |  /  /       \__\   |");
	print("|      |  |           \    /           |  |       ____    |  |__|  /     |  |__|  | |  |               |");
	print("|      |  |           /    \           |  |      |____|   |       /      |   ____/  |  |        ____   |");
	print("|      |  |          /  /\  \          |  |               |  |\  \       |  |       |  |       |__  |  |");
	print("|      |  |         /  /  \  \         |  |               |  | \  \      |  |       |   \        /  |  |");
	print("|     _/  \_     |\/  /    \  \/|     _/  \_              |  |  \  \/|  _/  \_       \   \______/  /   |");
	print("|    |      |    |/  /      \  \|    |      |             |  |   \  \| |      |       \           /    |");
	print("--------------------------------------------------------------------------------------------------------");
	print("|                                             | DEMO |                                                 |");
	print("--------------------------------------------------------------------------------------------------------");
	time.sleep(1);
	print("|                                                                                                      |");
	print("|                                         ->   ИГРАТЬ   <-                                             |");
	print("|                                                                                                      |");
	print("|                                                                                                      |");
	print("|                                         ->   АВТОРЫ   <-                                             |");
	print("|                                                                                                      |");
	print("|                                                                                                      |");
	print("|                                         -> КАК ИГРАТЬ <-                                             |");
	print("|                                                                                                      |");
	print("--------------------------------------------------------------------------------------------------------");
	#Изображение главного меню
	time.sleep(1);
	print("| Что-бы выбрать \"ИГРАТЬ\", \"АВТОРЫ\" или \"КАК ИГРАТЬ\" - напишите название кнопки снизу.                 |");
	userchoice = input("| ");
	#Выбор вкладки
	if userchoice.lower() == "авторы":
		#Вкладка авторы
		print("|------------------------------------------------------------------------------------------------------|");
		print("|                                           -> АВТОРЫ <-                                               |");
		print("|                                                                                                      |");
		print("| Автор - Chelik Floppa;                                                                               |");
		print("| Соавтор - 9jh, Ferdy, Nuke;                                                                          |");
		print("| Сценаристы - 9jh, Chelik Floppa, Nuke;                                                               |");
		print("| Художник - Chelik_Floppa;                                                                            |");
		print("| Писатель кода - Chelik Floppa;                                                                       |");
		print("| Тестировщики Геймплея - Chelik_Floppa, Ferdy и Nuke;                                                 |");
		#Комментарии by Nuke#0362
		print("| Тестировщик Кода - Nuke.                                                                             |");
		print("|                                                                                                      |");
		print("--------------------------------------------------------------------------------------------------------");

		time.sleep(3);
		#Окончание вкладки авторы

		print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
		#выход в главное меню
		userchoice = input("| ");

		if userchoice.lower() == "выйти":
			mainmenu();
			#Выход
	elif userchoice.lower() == "как играть":
		#Вкладка как играть
		print("--------------------------------------------------------------------------------------------------------");
		print("|                                         -> КАК ИГРАТЬ <-                                             |");
		print("|                                                                                                      |");
		print("| Что-бы выбрать действие - напишите название кнопки соответствующего действия.                        |");
		print("|                                                                                                      |");
		print("--------------------------------------------------------------------------------------------------------");
		time.sleep(3);
		print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
		#Вкладка выйти
		userchoice = input("| ");
		if userchoice.lower() == "выйти":
			mainmenu();
	#Начало игры
	elif userchoice.lower() == "играть":
		#Функция presstart
		presstart();

def presstart():
	#Функция старта игры
	print("--------------------------------------------------------------------------------------------------------");
	print("|                                                                                                      |");
	print("|                                       -> ВЫБРАТЬ  ПЕРСОНАЖА <-                                       |");
	print("|                                                                                                      |");
	print("|           _____________________________                      _____________________________           |");
	print("|          |  _________________________  |                    |  _________________________  |          |");
	print("|          | |        ##         /\    | |                    | |       ___________       | |          |");
	print("|          | |     ____#___      ||    | |                    | |      /           \      | |          |");
	print("|          | |    /  /     \_    ||    | |                    | |     /    _____    \     | |          |");
	print("|          | |   |  |   =====|  \  /   | |                    | |    |    /     \    |    | |          |");
	print("|          | |   |  |     ===|  |  |   | |                    | |    |___|      |    /    | |          |");
	print("|          | |   |  |       _| /  /    | |                    | |              /    /     | |          |");
	print("|          | |    \__\_____/  /  /     | |                    | |             /    /      | |          |");
	print("|          | |  ____/    \___/  /      | |                    | |            /    /       | |          |");
	print("|          | | /              _/       | |                    | |           /____/        | |          |");
	print("|          | |/  /| \_____/  /         | |                    | |           ____          | |          |");
	print("|          | |  | |  |   |  |          | |                    | |          |    |         | |          |");
	print("|          | |  | |         |          | |                    | |          |____|         | |          |");
	print("|          | |__|_|_________|__________| |                    | |_________________________| |          |");
	print("|          |_____________________________|                    |_____________________________|          |");
	print("|                                                                                                      |");
	print("|                  -( РЫЦАРЬ )-                           -( Будет доступно в обновлении 1.0.0 )-      |");
	print("|                                                                                                      |");
	print("--------------------------------------------------------------------------------------------------------");
	#Графика Меню
	print("| Что-бы выбрать персонажа напишите его имя.                                                           |");
	time.sleep(1);
	#Выбор Персонажа
	print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
	userchoice = input("| ");
	if userchoice.lower() == "рыцарь":
		#Функция Инвентаря
		knightinventorymenu();

def knightinventorymenu():
	#Функция Инвентаря (Недоделанная)
	print("--------------------------------------------------------------------------------------------------------");
	print("|                                                                                                      |");
	print("|                                           -> РЫЦАРЬ <-                                               |");
	print("|           _____________________________                                                              |");
	print("|          |  _________________________  |    _________________________ ________________________       |");
	print("|          | |        ##         /\    | |   |                                                  |      |");
	print("|          | |     ____#___      ||    | |   | - Описание и инвентарь ещё недоступны,           |      |");
	print("|          | |    /  /     \_    ||    | |   | - возможно появятся в версии 0.1.0               |      |");
	print("|          | |   |  |   =====|  \  /   | |   |                                                  |      |");
	print("|          | |   |  |     ===|  |  |   | |   |                                                  |      |");
	print("|          | |   |  |       _| /  /    | |   |                                                  |      |");
	print("|          | |    \__\_____/  /  /     | |   |_________________________ ________________________|      |");
	print("|          | |  ____/    \___/  /      | |                                                             |");
	print("|          | | /              _/       | |                                                             |");
	print("|          | |/  /| \_____/  /         | |                                                             |");
	print("|          | |  | |  |   |  |          | |                                                             |");
	print("|          | |  | |         |          | |                                                             |");
	print("|          | |__|_|_________|__________| |                                                             |")
	print("|          |_____________________________|                                                             |");
	print("--------------------------------------------------------------------------------------------------------");
	#Графика Рыцаря
	print("| Напишите слово \"Вперёд\" снизу что-бы начать путешествие.                                             |");
	time.sleep(1);
	print("| Напишите слово \"Назад\" снизу что-бы вернутся назад.                                                  |");
	time.sleep(1);
	print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
	#Выбор игрока
	userchoice = input("| ");
	if userchoice.lower() == "вперёд":
		print("--------------------------------------------------------------------------------------------------------");
		print("|                                         -> НЕДОСТУПНО <-                                             |");
		print("|                                                                                                      |");
		print("| Ещё недоступно, возможно появится в версии 0.1.0                                                     |");
		print("--------------------------------------------------------------------------------------------------------");
		print("| Напишите слово \"Назад\" снизу что-бы вернутся назад.                                                  |");
		time.sleep(1);
		print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
		#Графика
		userchoice = input("| ");
		if userchoice.lower() == "назад":
			knightinventorymenu();
		elif userchoice.lower() == "выйти":
			mainmenu();
	elif userchoice.lower() == "выйти":
		mainmenu();
	elif userchoice.lower() == "назад":
		presstart();
		#Выбор
#Начало
mainmenu();
