import random;
import time;
charactername = " РЫЦАРЬ  "
#Импорт библиотек

def mainmenu():
	print("--------------------------------------------------------------------------------------------------------");
	print("|                                                                                                      |");
	print("--------------------------------------------------------------------------------------------------------");
	print("| | ___    ___ |  |\  \    /  /|  | ___    ___ |        |     _   \    |     __  \     /  _____  \     |");
	print("| |/   |  |   \|  |/\  \  /  /\|  |/   |  |   \|        |/|  | \   |   |/|  |  |  \   /  /     \  \    |");
	print("|      |  |          \  \/  /          |  |               |  |  |  |     |  |  |  |  /  /       \__\   |");
	print("|      |  |           \    /           |  |       ____    |  |__|  /     |  |__|  | |  |               |");
	print("|      |  |           /    \           |  |      |____|   |       /      |   ____/  |  |        ____   |");
	print("|      |  |          /  /\  \          |  |               |  |\  \       |  |       |  |       |__  |  |");
	print("|      |  |         /  /  \  \         |  |               |  | \  \      |  |       |   \        /  |  |");
	print("|     _/  \_     |\/  /    \  \/|     _/  \_              |  |  \  \/|  _/  \_       \   \______/  /   |");
	print("|    |      |    |/  /      \  \|    |      |             |  |   \  \| |      |       \           /    |");
	print("--------------------------------------------------------------------------------------------------------");
	print("|                                             | DEMO |                                                 |");
	print("--------------------------------------------------------------------------------------------------------");
	time.sleep(1);
	print("|                                                                                                      |");
	print("|                                         ->   ИГРАТЬ   <-                                             |");
	print("|                                                                                                      |");
	print("|                                                                                                      |");
	print("|                                         ->   АВТОРЫ   <-                                             |");
	print("|                                                                                                      |");
	print("|                                                                                                      |");
	print("|                                         -> КАК ИГРАТЬ <-                                             |");
	print("|                                                                                                      |");
	print("--------------------------------------------------------------------------------------------------------");
	time.sleep(1);
	print("| Что-бы выбрать \"ИГРАТЬ\", \"АВТОРЫ\" или \"КАК ИГРАТЬ\" - напишите название кнопки снизу.                 |");
	userchoice = input("| ");
	if userchoice.lower() == "авторы":
		print("|------------------------------------------------------------------------------------------------------|");
		print("|                                              АВТОРЫ:                                                 |");
		print("|                                                                                                      |");
		print("| Автор - Chelik Floppa;                                                                               |");
		print("| Соавтор - 9jh;                                                                                       |");
		print("| Сценаристы - 9jh, Chelik Floppa;                                                                     |");
		print("| Художник - Chelik_Floppa;                                                                            |");
		print("| Писатель кода - Chelik Floppa, Nuke                                                                  |");
		print("| Тестировщики  Геймплея - Ferdy,   кирилл чуприна.                                                    |");
		print("|                                                                                                      |");
		print("--------------------------------------------------------------------------------------------------------");
		time.sleep(3);
		print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
		userchoice = input("| ");
		if userchoice.lower() == "выйти":
			mainmenu();
	elif userchoice.lower() == "как играть":
		print("--------------------------------------------------------------------------------------------------------");
		print("|                                            КАК ИГРАТЬ                                                |");
		print("|                                                                                                      |");
		print("| Что-бы выбрать действие - напишите название кнопки соответствующего действия.                        |");
		print("|                                                                                                      |");
		print("--------------------------------------------------------------------------------------------------------");
		time.sleep(3);
		print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
		userchoice = input("| ");
		if userchoice.lower() == "выйти":
			mainmenu();
	elif userchoice.lower() == "играть":
		presstart();

def presstart():
	print("--------------------------------------------------------------------------------------------------------");
	print("|                                          ВЫБРАТЬ  ПЕРСОНАЖА                                          |");
	print("|             _________________________                          _________________________             |");
	print("|            |        ##         /\    |                        |       ___________       |            |");
	print("|            |     ____#___      ||    |                        |      /           \      |            |");
	print("|            |    /  /     \_    ||    |                        |     /    _____    \     |            |");
	print("|            |   |  |   =====|  \  /   |                        |    |    /     \    |    |            |");
	print("|            |   |  |     ===|  |  |   |                        |    |___|      |    /    |            |");
	print("|            |   |  |       _| /  /    |                        |              /    /     |            |");
	print("|            |    \__\_____/  /  /     |                        |             /    /      |            |");
	print("|            |  ____/    \___/  /      |                        |            /    /       |            |");
	print("|            | /              _/       |                        |           /____/        |            |");
	print("|            |/  /| \_____/  /         |                        |           ____          |            |");
	print("|            |  | |  |   |  |          |                        |          |    |         |            |");
	print("|            |  | |         |          |                        |          |____|         |            |");
	print("|            |__|_|_________|__________|                        |_________________________|            |");
	print("|                                                                                                      |");
	print("|                  -( РЫЦАРЬ )-                           -( Будет доступно в обновлении 1.0.0 )-      |");
	print("|                                                                                                      |");
	print("--------------------------------------------------------------------------------------------------------");
	print("| Что-бы выбрать персонажа напишите его имя.                                                           |");
	time.sleep(1);
	print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
	userchoice = input("| ");
	if userchoice.lower() == "рыцарь":
		charactername = " РЫЦАРЬ  "
		inwentorymenu();

def inwentorymenu():
	print("--------------------------------------------------------------------------------------------------------");
	print("|                                             ", charactername, "                                                |");
	print("|             _________________________       _________________________ ________________________       |");
	print("|            |        ##         /\    |     |                                                  |      |");
	print("|            |     ____#___      ||    |     | - Описание и инвентарь ещё недоступны,           |      |");
	print("|            |    /  /     \_    ||    |     | - возможно появятся в версии 0.1.0               |      |");
	print("|            |   |  |   =====|  \  /   |     |                                                  |      |");
	print("|            |   |  |     ===|  |  |   |     |                                                  |      |");
	print("|            |   |  |       _| /  /    |     |                                                  |      |");
	print("|            |    \__\_____/  /  /     |     |_________________________ ________________________|      |");
	print("|            |  ____/    \___/  /      |                                                               |");
	print("|            | /              _/       |                                                               |");
	print("|            |/  /| \_____/  /         |                                                               |");
	print("|            |  | |  |   |  |          |                                                               |");
	print("|            |  | |         |          |                                                               |");
	print("|            |__|_|_________|__________|                                                               |")
	print("|                                                                                                      |");
	print("--------------------------------------------------------------------------------------------------------");
	print("| Напишите слово \"Вперёд\" снизу что-бы начать путешествие.                                             |");
	time.sleep(1);
	print("| Напишите слово \"Назад\" снизу что-бы вернутся назад.                                                  |");
	time.sleep(1);
	print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                            |");
	userchoice = input("| ");
	if userchoice.lower() == "вперёд":
		print("--------------------------------------------------------------------------------------------------------");
		print("|                                            НЕДОСТУПНО                                                |");
		print("|                                                                                                      |");
		print("| Ещё недоступно, возможно появится в версии 0.1.0                                                     |");
		print("--------------------------------------------------------------------------------------------------------");
		print("| Напишите слово \"Назад\" снизу что-бы вернутся назад.                                                |");
		time.sleep(1);
		print("| Напишите слово \"Выйти\" снизу что-бы выйти в главное меню.                                          |");
		userchoice = input("| ");
		if userchoice.lower() == "назад":
			inwentorymenu();
		elif userchoice.lower() == "выйти":
			mainmenu();
	elif userchoice.lower() == "выйти":
		mainmenu();
	elif userchoice.lower() == "назад":
		presstart();

mainmenu();
